from .. import *


@sbb_b.ar_cmd(pattern="الاوامر")
async def hi(event):
    await edit_or_reply(
        event,
        "**[ ادثون ميوزك 𖤍 .](t.me/adthon)**\n ┄─━━◉━━─┄━━─┄━─┄━─┄─━━◉━━─┄━━─┄━─**\n\n** اهلا بك اليك قائمة الاوامر المخصةة لسورس ادثون ميوزك𖠊\n\n`.م1 ⟸ ` اوامـر المجموعة + اوامر النشر التلقائي \n`.م2` ⟸ اوامـر الحساب\n`.م3` ⟸ اوامـر التـرحـيـب\n`.م4` ⟸ اوامـر الـردود\n`.م5` ⟸ اوامـر الـتـرفـيـه\n`.م6` ⟸ اوامـر حـمـايـه الـخـاص\n`.م7` ⟸ اوامـر الإذاعـه و الـكـشف \n`.م8` ⟸ اوامـر الـبـوت \n`.م9` ⟸ اوامـر الـمـنع والـتـرجـمـه\n`.م10` ⟸اوامـر الـتـلـكراف و الـنـطـق\n`.م11` ⟸اوامـر الـتـحـمـيل\n`.م12` ⟸اوامـر التـكــرار\n`.م13` ⟸اوامـر الانـتـحـال والـتـقـلـيـد\n`.م14` ⟸اوامـر الـوقـتـي \n`.م15` ⟸اوامـر الـذاتـيـه والاضـافـه\n`.م16` ⟸اوامـر الـبـروفايـل\n`.م17` ⟸اوامـر الأكـسـتـرا\n`.م18` ⟸الـتاك و الـملـفات\n`.م19` ⟸اوامـر الـصـيـغ\n`.م20` ⟸اوامـر الـــتــسلـيـة\n`.م21` ⟸اوامـر الـــتـحـكـم\n`.م22` ⟸اوامـر حـمـايـة الـمـجـموعـات",
        link_preview=False,
    )
rehu = [
    "قلوبنا صنعت للخير لم تصنع للشر",
    "إن الله هو الغفور الرحيم",
    "شكرًا لتنصيبك ادثون العربي",
]
@sbb_b.ar_cmd(pattern="م1")
async def hi(event):
    await edit_or_reply(
        event,
        "**قائـمه اوامـر الادمن :**\n⟸ `حظر` \n❖ لحظر الشخص في مجموعه بالرد عليه\n\n ⟸ `وضع قر`\n❖ اكتب الامر في المجموعة بالرد على صورة لتغيير صورتها\n\n ⟸ `الغاء حظر`\n❖بالرد على الشخص المحظور لالغاء حظره\n\n ⟸ `الغاء كتم`\n❖ لالغاء كتم الشخص من المجموعه بالرد عليه\n\n ⟸ `كتم` \n❖ لكتم الشخص بالرد عليه او وضع معرفه مع الامر\n\n ⟸ `غتث`\n❖ لالغاء تثبيت الرسالة بالرد عليها بالامر\n\n ⟸ `تث` \n❖ بالرد على الرسالة لتثبيتها في المجموعة\n\n ⟸ `تنزيل` \n❖ بالدرعلى الشخص لتنزيله من الاشراف\n\n ⟸ `طرد`\n❖ لطرد المستخدم من القروب\n\n ⟸ `البوتات ` \n❖لعرض قائمة البوتات بالقروب \n\n ⟸ `زومبي`\n❖ لطرد جميع الحسابات المحذوفة\n\n ⟸ `الادمن`\n❖ لعرض الادمنية بالقروب\n\n ⟸ `الرابط`\n❖ فقط ارسل الامر لعرض رابط المجموعه \n\n ⟸ `دعوة @يوزر الشخص`\n❖ يضيف الشخص الى المجموعة\n\n ⟸ `اضافة @يوزر القروب`\n❖ سرقة الاعضاء ( يحظر الحساب انتبه )",
    )

@sbb_b.ar_cmd(pattern="م2")
async def hi(event):
    await edit_or_reply(
        event,
        "**⌔∮ قائـمة اوامـر الـــتــسلـيـة**: \n\n`ارمي عقلك`  `حبيبي`  `زحف`   `سحر`    `ديناصور`\n\n`انتحار`   `تهديد`     `بووم`     `تهكير`\n\n`افكر`    `.متت`    `.ضايج`    `هليكوبتر`\n\n`كلب`    `ناه`     `جري`     `لايك`\n\n`احبك`      `حب`     `همم`    `حضن`",
        link_preview=False,
    )


@sbb_b.ar_cmd(pattern="م3")
async def hi(event):
    await edit_or_reply(
        event,
        "قائمـه اوامـر حماية الخاص :\n\n ⟸ `.الحماية تشغيل`\n❖ لتشغيل امر الحمايه يستخدم لتحذير المستخدمين عند مراسلتك في الخاص من التـكــرار\n\n ⟸ `.الحماية تعطيل`\n❖ لتعطيل امر الحمايه وعدم تحذير المستخدمين في الخاص\n\n ⟸ `قبول` او `y`\n❖ يستخدم الامر لقبول الشخص في الخاص وعدم ارسال تحذيرات له بالرد على الشخص\n\n ⟸ `رفض` او `g`\n❖ يستخدم لرفض الشخص من الخاص وتحذيره اذا كرر الرسائل وبعدها حظره\n\n ⟸ `جلبر`\n❖ لعرض رسالة الحماية\n\n ⟸ `ريست`\n❖ لاعادة ضبط اوامر الحماية\n\n ⟸ `وضعر` بالرد على الرسالة\n❖ لوضع كليشة الحماية\n\n⌔∮  + لرقم :لوضع عدد التحذيرات `تحذير`",
        link_preview=False,
    )


@sbb_b.ar_cmd(pattern="م4")
async def hi(event):
    await edit_or_reply(
        event,
        "قائمـه اوامـر الكشف والاذاعة  :\n\n ⟸ `مع`\n❖ لعرض معلومات حسابك\n\n ⟸ `ايديه`\n❖ بالرد على المستخدم لعرض معلومات معينه عنه\n\n ⟸ `كشف`\n❖ يجلب لك كل معلومات القروب او القناة.\n\n ⟸ `اذاعة خاص`\n❖ اكتب الامر بالرد على رساله او اي ميديا ليقوم بارساله لجميع المحادثات في الخاص\n\n ⟸ `.اذاعة قر`\n❖ بالرد على نص او اي ميديا ليقوم بنشره في جمبع المجموعات",
        link_preview=False,
    )

@sbb_b.ar_cmd(pattern="م5")
async def hi(event):
    await edit_or_reply(
        event,
        "** قائـمه اوامـر التـكــرار**:\n\n⟸`.كرر`\n❖ اكتب الامر مع عدد التـكــرار بالرد ؏ النص او او صورة ملصق ليقوم بتكراره مع العدد الذي وضعته\n\n ⟸ `.تكرار الملصق` \n❖ بالرد على الملصق ليقوم باستخراج جميع ملصقات الحزمه وارسالها في الدردشة\n\n ⟸`.مكرر`\n❖ اكتب الامر مع وقت بالثواني و مع عدد التـكــرار وبالرد على صورة او نص  (  تكرار وقتي  )\n\n ⟸ `.التـكــرار`\n❖ بالرد على الرسالة بالامر فقط سيقوم بعمل تكرار سريع ويصل عدده الى 10 الاف تكرار  ! \n\n ⟸ `.ايقاف التـكــرار`\n❖ يقوم هذا الامر بأيقاف التـكــرار فقط اكتبه\n\n** تنبيه اوامـر التـكــرار قد تؤدي الى حظر حسابك على التلي اذا استخدمتها بشكل غير صحيح**",
    )


@sbb_b.ar_cmd(pattern="م6")
async def hi(event):
    await edit_or_reply(
        event,
        "قائمـه اوامـر الـتـلـكراف   :\n\n ⟸ `تلي`  ⟸ \n❖ بالرد على الميديا لصنع رابط تـلـكراف منها",
    )


@sbb_b.ar_cmd(pattern="م7")
async def hi(event):
    await edit_or_reply(
        event,
        "قائمـه اوامـر الـتـحـمـيل البحث:\n\n ⟸ `جيف`\n❖ بكتابة عنوان مع الامر لجلب متحركة لك من العنوان\n\n ⟸ `gimg`\n❖ بكتابة اسم لعبة مع الامر لعرض صور للعبة\n\n ⟸ `فيديو`\n❖ مع رابط من يوتيوب او مع كلمة للبحث والتحميل\n\n ⟸ `صوت`\n❖ اكتب الامر مع الرابط من اليوتيوب او مع كتابة كلمة لتحميل مقطع الصوتي و ارساله لك\n\n ⟸ `سوش`\n❖ اكتب الامر مع الرابط للـتـحـمـيل من التيك او انستا او يوت او فيس \n\n ⟸ `pic`\n❖ اكتب الامر مع عنوان للبحث عنه وارسال لك الصور،  اذا بحثت عن اباحي سيتم تعطيل حسابك\n\nحفظ الخاص\n\nتخزين القروبات",
    )


@sbb_b.ar_cmd(pattern="م8")
async def hi(event):
    await edit_or_reply(
        event,
        "ss <الرابط'>", "للحصول على لقطة شاشة لصفحة ويب معينة\n\nاذان <اسم المدينة بالانجليزي> لعرض اوقات الصلاة\n\n pap صور عشوائية\n\n ayang صور عشوائية.\n\nppcp2 تطقيمات 2./n/nanime صور انمي.\n\nanime2 صور انمي 2.\n\nصوت <بالرد على الفيديو> تحويل الفيديو الى صوت\n\nاكتب buat gc او ch لانشاء قناة او مجموعة تلقائيا\n\n",
    )


@sbb_b.ar_cmd(pattern="م9")
async def hi(event):
    await edit_or_reply(
        event,
        "⟸ `حذف` بالرد\n❖ لحذف الرسالة\n\n ⟸ `مسح`ها\n❖ حدد الرسالة الي تبي تبدأ حذف منها\n\n ⟸ `احذف`العدد\n❖ واضح\n\n ⟸ `مكرر`  العدد + الرسالة\n❖ ينشر تلقائي الرسالة بالمكان حسب العدد\n\n ⟸ `تك` + وقت الانتظار + العدد + الرسالة\n نفس الي قبله بس هذايخلي وقت بين كل رسالة ورسالة بالتكرار\n\n ⟸ `سبام` بالرد على الملصق + العدد\n❖ يكرر الملصق حسب العدد\n\n ⟸ `تاج` + النص\n\n`ستوب`\n❖ يوقف التاج",
    )


@sbb_b.ar_cmd(pattern="م10")
async def hi(event):
    await edit_or_reply(
        event,
        "`ابدا` لبدء محادثة صوتية\n\n`انهي` ينهي المحادثة الصوتية\n\n`ادخل` يدل للمحادثة و `اخرج` يخرج منها\n\n`تشغيل` تشغيل الموسيقى والفيديو حسب عنوان الأغنية.\n\n` تخطي` تخطي الي شغال.\n\n`استئناف` يكمل التشغيل.\n\n`توقف` يوقف الشغال\n\n`انهاء` ينهي.\n\n`بدء` او `قائمة` لتشغيل القائمة.",
    )


@sbb_b.ar_cmd(pattern="م11")
async def hi(event):
    await edit_or_reply(
        event,
        "الخلفية الرد على الصورة لإزالة الخلفية من الصورة.\n\nرسوم <بالرد على الصورة> تحويل الصور إلى رسوم متحركة باستخدام ai bot\n\nملصق <بالرد على  الستيكر> تحويل الملصق إلى صورة..\n\nناري بالرد على الصور لتجميل الصورة باستخدام ناري ديباي..\n\nابيوس بالرد على الصور لعمل صورة بالأبيض والأسود.\n\nوجه بالرد على الصور لاخراج الوجه من الصور.\n\nرس بالرد ينشئ صورة لرسالتك\n\nتويت بالرد لانشاء بوست تويتر.\n\nبلوك لحظر الشخص\n\nفك لالغاء الحظر عن الشخص\n\nاسم لوضع اسم حسابك.\n\nبايو لوضع بايو حسابك.\n\nصورة لوضع صورة حسابك.\n\nلوجو الكلمة يصنع شعار.\n\nلوجوو الكلمة يصنع شعار.\n\nقبل تشغيل سجل الخاص او تخزين القروبات ضع قروب التخزين بالامر : تخزين + ايدي القروب .\n\nتحقق يشوف حسابك محظور او لا",
    )


@sbb_b.ar_cmd(pattern="م11")
async def hi(event):
    await edit_or_reply(
        event,
        "lock all atau spesiic content membatasi kiriman group.\n\nunlock all atau spesiic content\n\nmembuka lock spesiic content : Locks / Unlocks:` `msg` | `media` | `stickers` | `polls` | `ino`  | `invite` | `webprev` |`pin` | `all`.\n\nحظرر <ربالرد/الايدي/المعف> حظر من كل القنوات والمجموعات التي انت مشرف فيها\n\nالغاء عام <بالرد/الايدي/المعرف> يقوم بالغاء الحظر العام.\n\nزخرفة + رقم من 1 - 8 بالرد على الرسالة يزخرف اي كلمة او اسم لعرض الخطوط اكب خط او خطوط\n\nخط لعرض خطوط الزخرفة.\n\nارسال @username الرسالة يرسل رسالة للمحادثة بدون ما تروح لها.",
    )

