

TRUTH = [
    "اخر شي سويته?"
    "سرقت فلوس من اهلك قبل?",
    "تحب الاطفال?",
    "لو خيروك بين المال او السلطة",
    "لو خيروك اليابان ولا اميركا",
    "بكل فخر من وين انت",
    "تحب اللعب بالحديقة?",
    "كم عمرك؟",
    "لو خيروك حب لو صداقة وليه?",
    "اخر مرة طلعت من البيت?",
    "متناقض؟",
    "جوعان؟",
    "كيف نفسيتك؟?",
    "اسألني سؤال.",
    "منشن اعز صديق لك?",
    "منشن شخص غثيث :')",
    "@B_IDU تعرف عليه يبدو لطيفا ⚠️هذا امر خاص بك انا ليس لدي علاقة!",
  
]

DARE = [
       "إظهار أخطر الصور على هاتفك" ,
       "يُظهر آخر خمسة أشخاص تحدثت معهم وما تحتويه رسالتهم" ,
       "قل أنا قبيح 5 مرات مع ملاحظة صوتية" ,
       "أكل الثوم النيء" ,
       "متوسط 10 قتلات فرقة في pubg or free fire" ,
       "ضع ثلاث قطع ثلج في فمك حتى تذوب" ,
       "قل شيئًا سيئًا للشخص على يسارك. لديك أصدقاء!" ,
       "امنح الشخص الذي على يمينك تدليك قدمه" ,
       "ضع 10 سوائل مختلفة متوفرة في الكوب واشربها" ,
       "قل الكلمة الأولى التي تخطر ببالك" ,
       "اعطِ رقصة حضن لشخص من اختيارك" ,
       "نام" ,
       "مثل أول 3 منشورًا في موجز الأخبار على Facebook" ,
       "تناول ملعقة من الملح" ,
       "أغمض عينيك حتى تذهب مرة أخرى" ,
       "مسامح من التحدي" ,
       "ارسل وجهك" ,
       "أكل الموز بشكل مغر" ,
       "أفرغ محفظتك وأظهر للجميع ما بداخلها" ,
       "ابذل قصارى جهدك في عملية الزحف المثيرة" ,
       "تظاهر بأنك الشخص على يمينك لمدة 10 دقائق"
       "تناول وجبة خفيفة دون استخدام اليدين" ,
       "قل شيئين صادقين عن كل فرد في المجموعة" ,
       "twerk قليلاً",
       "حاول أن تجعل أعضاء المجموعة يضحكون بأسرع ما يمكن" ,
       "حاول أن تضع قبضة يدك بالكامل في فمك" ,
       "أخبر الجميع بقصة مؤسفة عن نفسك" ,
       "حاول ان تلعق كوعك " ,
       "انشر أقدم صورة ذاتية على هاتفك في قصص Instagram" ,
       "أخبرني عن أتعس قصة تعرفها" ,
       "عواء كالذئب لمدة دقيقتين" ,
       "ارقص بدون موسيقى لمدة دقيقتين" ,
       "ارقص" ,
       "دع الآخرين يدغدغوك وحاول ألا تضحك" ,
       "ضع أكبر عدد ممكن من الوجبات الخفيفة في فمك دفعة واحدة" ,
       "أرسل أحدث صورة شخصية لك." ,
       "أرسل أبشع صورة شخصية لك." ,
       "أرسل لقطة شاشة لسجل البحث على Facebook" ,
       "ارسل لقطة شاشة من معرض الصور الخاص بك." ,
       "ارسل لقطة شاشة لمحادثاتك" ,
       "قل شيئًا حميميًا جدًا." ,
       "أرسل لقطة شاشة لبريدك الوارد في Twitter" ,
       "أرسل لقطة شاشة لشاشتك الرئيسية." ,
       "أرسل غلافًا لأغنيتك المفضلة." ,
       "قم بعمل مزحة غنائية على شخص ما وأرسل دليلاً على ذلك." ,
       "اعترف بأنك معجب بزميلك الحالي في الصف. ❤️" ,
       "اعترف من الذي تحبه" ,
       "ارسل لقطة شاشة من معرض الصور الخاص بك." ,
       "اجعل صورة الشخص الذي يعجبك كخلفية للدردشة.",
       "أخبر @B_IDU أنه وسيم" ,
]

AP = ["Iya", 
                "لا",
                  "ممكن",
                  "على الاغلب لا",
                  "يمكن ان تكون",
                  "على الاغلب لا",
                  "مستحيل",
                  "هل يجب علي الإجابة حقًا؟"
                  "ما الخطأ في السؤال؟"
                  "حقًا؟",
                  "كيف أعرف",
                  "تسألني , ثم أسأل من؟"
                  "اسأل بيدو"
                 ]
                 
KN = ["Iya", 
            "يارا تعرف نعم" ,
                  "لماذا تسالني",
                  "ناني ماذا" ,
                  "اسأل والدتك"
                  "اسأل والد خالد" ,
                  "لأنك لم تستحم" ,
                  "هل يجب علي الإجابة حقًا؟"
                  "ما الخطأ في السؤال؟"
                  "حقًا؟",
                  "كيف أعرف",
                  "تسألني , ثم أسأل من؟"
                  "ناني مولو"
                  "لأنك غبي"
                 ]
                 
BG = [
    "Tau ya", 
                 "لا او نعم ?", 
                 "انت غبي", 
                 "الجواب لان 5-8=4-78=9 اذن 6×4=60", 
                 "لم افهم", 
                 "انت غبي",
                 "انا لست بوت",
                 "حل حقا تريد الجواب",
                 "اذهب للنوم",
                 "هل يجب علي الاجابة?",
                 "لا تسألأ مرة اخرى ",
                 "ههههههههههه اي اي صح?",
                 "غبي صدق"
                 ]

